print("hello, world!")

print("---------------------------------------------------------------")

for i in range(100):
	print("Hello, World!")

print("---------------------------------------------------------------")

# 3重クオート　言語途中で改行できるようになる
print("""これは長い長い長い長い長い長い長い長い長い長い長い長い
長い長い長い長い長い長い長長い長い長い長い長いコードです""")

print("---------------------------------------------------------------")

# バックスラッシュ　キーワード直後、改行できるようになる
print\
("これは長い長い長い長い長い長い長い長い長い長い長い長い長い長い長い長い長い長い長長い長い長い長い長いコードです")

print("---------------------------------------------------------------")

#小数の計算OK
print(2.2+2.2)
