#複数の演算子
print(1==1 and 10!=2 and 2<10)
#出力　true

print("---------------------------------------------------------------")

#複数の演算子
print(1<=0 or 10>23 or 10!=10)
#出力　false

print("---------------------------------------------------------------")

#複数のif文
x=2
if x==2:
    print("数値は2です。")
if x%2==0:
    print("数値は偶数です。")
if x%2!=0:
    print("数値は奇数です。")

print("---------------------------------------------------------------")

#入れ子のif文
x=10
y=11
if x==10:
    if y==11:
        print(x+y)
print("---------------------------------------------------------------")

#複数の条件文の組み合わせ
x=100
if x==10:
    print("10!")
elif x==20:
    print("20!")
else:
    print("分かりません")

if x==100:
    print("xは100!")

if x%2==0:
    print("xは偶数！")
else:
    print("xは奇数！")
    